# Определить кратно ли число 3
x=int(input('введите число '))
if x % 3 == 0:
    print('yes')
else:
    print('no')