# Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.

x=str(input('1: '))
y=str(input('2: '))
print(x.count(y))